CSCI205/[01]lec-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-18 Sun 20:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Yahia Gaber" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfd8f3a8">1. Lecture #1</a>
<ul>
<li><a href="#org8e31b03">1.1. Program tracing and debugging</a>
<ul>
<li><a href="#orgdd17545">1.1.1. Embedded systems</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
date: 15-2-23
</p>
<div id="outline-container-orgfd8f3a8" class="outline-2">
<h2 id="orgfd8f3a8"><span class="section-number-2">1.</span> Lecture #1</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8e31b03" class="outline-3">
<h3 id="org8e31b03"><span class="section-number-3">1.1.</span> Program tracing and debugging</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A program to print &ldquo;hello world&rdquo;.
</p>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #87ceeb; font-weight: bold;">#include</span> <span style="color: #fab795;">&lt;stdio.h&gt;</span>

<span style="color: #87ceeb;">int</span> <span style="color: #87ceeb;">main</span>() {

    printf(<span style="color: #fab795;">"hello world"</span>);
    <span style="color: #b877db;">return</span> <span style="color: #f09383; font-weight: bold;">0</span>;
}

</pre>
</div>
</div>
<div id="outline-container-orgdd17545" class="outline-4">
<h4 id="orgdd17545"><span class="section-number-4">1.1.1.</span> Embedded systems</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
An embedded system is a compact programmable device 
intended to have a physical effect through taking physical
input and outputing a physical output.
</p>
</div>
<ol class="org-ol">
<li><a id="org6a2871a"></a>Arduino Uno<br />
<div class="outline-text-5" id="text-1-1-1-1">
<p>
Contains 14 digital pins, 6 analog pins a USB port and an ISCP header.
</p>
</div>
<ol class="org-ol">
<li><a id="org549931e"></a>Arduino commands and functions<br />
<div class="outline-text-6" id="text-1-1-1-1-1">
<ol class="org-ol">
<li><code>setup()</code>

<ul class="org-ul">
<li>Used to excute code at the start of the program that identifies pins.</li>
</ul></li>
</ol>

<div class="org-src-container">
<pre class="src src-c++">
<span style="color: #87ceeb;">void</span> <span style="color: #87ceeb;">setup</span>() {

    <span style="color: #87ceeb;">int</span> &lt;variable&gt; = &lt;<span style="color: #87ceeb;">pin</span> <span style="color: #e95678;">number</span>&gt;;

}

</pre>
</div>

<ol class="org-ol">
<li><code>loop()</code>

<ul class="org-ul">
<li>Containts code that is excuted while the board is running.</li>
</ul></li>
</ol>

<div class="org-src-container">
<pre class="src src-c++">
<span style="color: #87ceeb;">void</span> <span style="color: #87ceeb;">loop</span>() {

    digitalWrite(&lt;<span style="color: #87ceeb;">pin</span> <span style="color: #e95678;">number</span>&gt;, &lt;Value&gt;) <span style="color: #4e5059; font-style: italic;">// </span><span style="color: #4e5059; font-style: italic;">Value can be LOW or HIGH.</span>
}

</pre>
</div>

<ol class="org-ol">
<li><code>delay(&lt;time&gt;)</code>

<ul class="org-ul">
<li>Freezes the program for a specific period of time in ms.</li>
</ul></li>
</ol>

<div class="org-src-container">
<pre class="src src-c++">
delay(<span style="color: #f09383; font-weight: bold;">250</span>);

</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yahia Gaber</p>
<p class="date">Created: 2024-02-18 Sun 20:18</p>
</div>
</body>
</html>
