CSCI205/Markdown/[01]lec-1.md

# Table of Contents

1.  [Lecture #1](#orgb9b481d)
    1.  [Program tracing and debugging](#org65212d2)
        1.  [Embedded systems](#org5248b95)

date: 15-2-23


<a id="orgb9b481d"></a>

# Lecture #1


<a id="org65212d2"></a>

## Program tracing and debugging

A program to print &ldquo;hello world&rdquo;.

```c
#include <stdio.h>

int main() {

    printf("hello world");
    return 0;
}
```

<a id="org5248b95"></a>

### Embedded systems

An embedded system is a compact programmable device 
intended to have a physical effect through taking physical
input and outputing a physical output.

#### Arduino Uno

Contains 14 digital pins, 6 analog pins a USB port and an ISCP header.

-  Arduino commands and functions

    1.  `setup()`
        -   Used to excute code at the start of the program usually to identify pins.

```c    
void setup() {

    int <variable> = <pin number>;

}
```
        
2.  `loop()`
    -   Containts code that is excuted while the board is running.
        
```c            
void loop() {

    digitalWrite(<pin number>, <Value>) // Value can be LOW or HIGH.
}
```
        
3.  `delay(<time>)`
    -   Freezes the program for a specific period of time in ms.

```c
delay(250);
```
